In [1]:
x<-c(1:4,NA,6:7,NA)
x

[1]  1  2  3  4 NA  6  7 NA

In [2]:
#test the missing values in x vector
is.na(x)

[1] FALSE FALSE FALSE FALSE  TRUE FALSE FALSE  TRUE

In [3]:
#data frame with missing values

df<-data.frame(col1=c(10:12,NA),
               col2=c("I",NA,"am","fine"),
               col3=c(TRUE,FALSE,TRUE,FALSE),
               col4=c(1.2,2.3,NA,4.3),
               stringsAsFactors=FALSE)
df

  col1 col2 col3  col4
1 10   I     TRUE 1.2
2 11   NA   FALSE 2.3
3 12   am    TRUE  NA
4 NA   fine FALSE 4.3

In [4]:
#IDENTIFY THE MISSING VALUES IN THE DATA FRAME
is.na(df)

     col1  col2  col3  col4
[1,] FALSE FALSE FALSE FALSE
[2,] FALSE  TRUE FALSE FALSE
[3,] FALSE FALSE FALSE  TRUE
[4,]  TRUE FALSE FALSE FALSE

In [5]:
#identify the location of NA's in the vector
which(is.na(x))

[1] 5 8

In [7]:
#identify the location of NA's in the data frame
which(is.na(df))

[1]  4  6 15

In [8]:
#display the sum of NA's in vector
sum(is.na(x))

[1] 0

In [9]:
#display the sum of NA's in the data frame
sum(is.na(df))

[1] 3

In [10]:
#display the count of NA's in the each column of data frame
colSums(is.na(df))

col1 col2 col3 col4
   1    1    0    1

In [11]:
#in two ways missing values are coded i.e., NA and 99
#recode missing values with mean
#before recode x is
x
mean(x)
mean(x,na.rm=TRUE)
x[is.na(x)]<-mean(x,na.rm=TRUE)

[1] 1.000000 2.000000 3.000000 4.000000 3.833333 6.000000 7.000000 3.833333

[1] 3.833333

[1] 3.833333

In [12]:
#after recode x is
x
round(x,2)

[1] 1.000000 2.000000 3.000000 4.000000 3.833333 6.000000 7.000000 3.833333

[1] 1.00 2.00 3.00 4.00 3.83 6.00 7.00 3.83

In [13]:
# data frame with missing values coded as 99
df1<-data.frame(col1=c(1:3,99),col2=c(2.8,4.7,99,4.2))
df1

  col1 col2
1  1    2.8
2  2    4.7
3  3   99.0
4 99    4.2

In [14]:
#change 99 to NA
df1[df1==99]<-NA
df1

  col1 col2
1  1   2.8
2  2   4.7
3  3    NA
4 NA   4.2

In [15]:
#Exclude missing values
x1<-c(1:3,NA,4:5)
x1

[1]  1  2  3 NA  4  5

In [16]:
#display mean of x1
mean(x1)

[1] NA

In [17]:
#mean of x1 after excluding NA
mean(x1,na.rm=TRUE)

[1] 3

In [18]:
#DATA FRAME WITH MISSING VALUES
df

  col1 col2 col3  col4
1 10   I     TRUE 1.2
2 11   NA   FALSE 2.3
3 12   am    TRUE  NA
4 NA   fine FALSE 4.3

In [19]:
#list of complete rows of the data frame
complete.cases(df)

[1]  TRUE FALSE FALSE FALSE

In [20]:
#subset with complete.cases to get complete cases
df[complete.cases(df),]

  col1 col2 col3 col4
1 10   I    TRUE 1.2

In [21]:
#subset with ! to get incomplete cases
df[!complete.cases(df),]

  col1 col2 col3  col4
2 11   NA   FALSE 2.3
3 12   am    TRUE  NA
4 NA   fine FALSE 4.3

In [22]:
#short hand way to get the complete cases of data frame by omitting 
na.omit(df)

  col1 col2 col3 col4
1 10   I    TRUE 1.2